{
  "title":"Smoked Whole Chicken with Honey Glaze",
  "description":"This smoked whole chicken recipe is perfect for your Pit Boss Wood Pellet Grill or smoker. Easy to prepare and smoke, the halved chicken is topped with a lemon honey glaze for a nice combination of zesty, sweet flavors.",
  "date":"2019-10-08",
  "url":"https://pitboss-grills.com/smoked-whole-chicken-with-honey-glaze-pit-boss-grills",
  "prepTime":"30 minutes",
  "cookTime":"140 minutes",
  "totalTime":"170 minutes",
  "servings":4,
  "directions":[
    "Start up your Pit Boss Smoker. Once it’s fired up, set the temperature to 225°F.",
    "On a clean cutting board, place the chicken breast side down. Using the kitchen shears, cut on either side of the spine all the way up either side of the back and remove the spine, discarding. Flip the chicken over, breast side up. Using a very sharp knife, cut the chicken in half through the breast bone.",
    "Generously sprinkle the chicken halves with Champion Chicken and let the chicken sit at room temperature for one hour.",
    "In a small saucepan, melt together the butter and honey over low heat. Squeeze ½ lemon into the honey mixture and remove from the heat.",
    "Smoke the chicken, skin side down until the chicken is lightly browned and the skin releases from the grate without ripping, about 6-8 minutes. Turn the chicken over and baste with the honey butter mixture. Continue to smoke the chicken, basting every 45 minutes, until the thickest part of the chicken reaches 160°F.",
    "Remove the chicken from the grill and allow it to rest for 5 minutes, then serve with the remaining sliced lemon."
  ],
  "notes":"Spicy Tip: Spice it up a little and add a tablespoon of our Mandarin Habanero Seasoning to your rub.",
  "ingredients":[
    "4 tablespoons unsalted butter",
    "1 tablespoon honey",
    "1 1/2 lemon",
    "4 pounds chicken, giblets removed and patted dry",
    "4 tablespoons Champion Chicken Seasoning"
  ],
  "tags":["chicken", "honey", "smoked chicken"]
}
