{
  "title":"Smoked Honey Garlic Chicken Wings",
  "description":"These Grilled Honey Garlic Chicken Wings get seasoned then in the smoker they go. Basted with a spicy honey garlic sauce, these are finger licking good and will be the hit of the party!",
  "date":"2019-10-08",
  "url":"https://keviniscooking.com/smoked-honey-garlic-chicken-wings/",
  "prepTime":"10 minutes",
  "cookTime":"75 minutes",
  "totalTime":"85 minutes",
  "servings":4,
  "directions":[
    "Preheat grill/smoker or oven to 350°F (See notes below). In a small bowl whisk together the seasoning salt and set aside.",
    "Lay chicken wings on rimmed baking sheets lined with aluminum foil or parchment paper. Season both sides of the wings with salt mixture.",
    "Place the baking sheet with wings directly on the grill grate and cook for 50-60 minutes, or until a dark golden brown.",
    "Meanwhile in a saucepan over medium heat, sauté the garlic in the butter for several minutes. Add remaining basting sauce ingredients and bring to a boil. Lower heat to low and simmer for 2 minutes. Turn off heat and cover.",
    "When wings are done (DO NOT turn off grill/smoker or oven) baste the wings with the sauce, turn and repeat. Place back in grill/smoker or oven and cover lid. Cook another 15 minutes.",
    "Remove and place on a platter, top with chopped chives (optional) and serve along side Ranch or Bleu Cheese dressing."
  ],
  "notes":"If smoking, set up wood chips as directed. I use a hickory, maple and cherry wood blend that Traeger makes for this recipe, but use whatever you prefer. ALSO IF BAKING: preheat oven to 350°F and also add 1/4 tsp liquid smoke to the basting sauce (only if baking). This should give the slight smokey flavor achieved in a smoker. I do not recommend to add this if you are smoking these.",
  "ingredients":[
    "3 pounds chicken wings (about 24 wings)",
    "6 tablespoons butter",
    "1/2 cup Tabasco (or favorite hot sauce)",
    "1/3 cup honey",
    "6 garlic cloves (minced)",
    "1 tablespoon kosher salt",
    "1 teaspoon celery salt",
    "1/2 teaspoon white pepper",
    "1/2 teaspoon smoked paprika",
    "3 tablespoons chives (chopped for garnish)",
    "Ranch or Bleu Cheese dressing for dipping"
  ],
  "tags":[
    "chicken wings",
    "honey garlic",
    "smoked wings",
    "tabasco"
  ]
}
