{
  "title":"Smoked Peppered Beef Jerk",
  "description":"Spiced up, irresistible beef jerky. This jerky is doused in a beer, soy sauce, and black pepper marinade, and smoked low and slow for an epic protein-packed snack.",
  "date":"2019-10-1",
  "url":"https://www.traegergrills.com/recipes/beef/peppered-beef-jerky",
  "imageUrl":"beef/images/smoked-peppered-beef-jerk.jpg",
  "prepTime":"15 minutes",
  "cookTime":"4 hours",
  "totalTime":"4 hours and 15 minutes",
  "servings": 5,
  "directions":[
    "In a mixing bowl, combine the beer, soy sauce, Worcestershire sauce, brown sugar, curing salt, garlic salt, and 2 tablespoons of the black pepper. With a sharp knife, trim any fat or connective tissue off of meat.",
    "Slice the beef into 1/4-inch thick slices against the grain. Put the beef slices into a large resealable plastic bag. Pour the marinade mixture over the beef, and massage the bag so that all the slices get coated with the marinade.",
    "Seal the bag and refrigerate for several hours to overnight.", 
    "When ready to cook, set temperature to 180℉ and preheat, lid closed for 15 minutes.",
    "For optimal flavor, use Super Smoke if available. Remove beef slices from the marinade and discard the marinade.",
    "Dry the beef slices between paper towels then sprinkle beef slices generously on both sides with black pepper.",
    "Arrange the meat in a single layer directly on the grill grate.",
    "Smoke for 4 to 5 hours or until the jerky is dry but still chewy and somewhat pliant when you bend a piece.Enjoy!"
               ],
  "notes":"Its easier to cut the meat if its partially frozen",
  "ingredients":[
    "1 (12 OZ) CAN OR BOTTLE DARK BEER ",
    "1 CUP SOY SAUCE ",
    "1/4 CUP WORCESTERSHIRE SAUCE",
    "3 TBSP BROWN SUGAR",
    "1 TBSP MORTON TENDER QUICK CURING SALT",
    "1/2 TSP GARLIC SALT",
    "3-4 TBSP COARSELY GROUND BLACK PEPPER, DIVIDED",
    "2 LBS TRIMMED BEEF TOP OR BOTTOM ROUND, SIRLOIN TIP, FLANK STEAK OR WILD GAME "
  ],
  "tags":[
  "Beef",
    "Jerk",
    "Easy",
    "South African"
  ]
}
