{
  "title":"BACON EXPLOSION",
  "description":"bacon wrapped meat",
  "date":"2019-010-02",
  "url":"https://www.cutsandcrumbles.com/bacon-explosion/",
  "prepTime":"30 minutes",
  "cookTime":"2 hours",
  "totalTime":"2 1/2 hours",
  "servings": 6,
  "directions":[
  "The first thing you will need to do is construct your bacon weave. Typically you want to make it 5×5 which I find will leave a couple extra pieces in the bacon package so in case one tears you can perform a repair to your weave with the extra slices. (Sorry, we went a little crazy with this weave at 8 slices each way…this larger weave used about 1 1/2 packages of thick cut bacon but all of the other ingredient amounts stayed the same!)",
  "Once the weave is completed, sprinkle some of that good ol’ rub on there.",
  "The next step is to put your sausage on the bacon weave. Be sure to press the sausage to the outer edges of the bacon creating a patty that is the same thickness all the way across. Most grocery stores carry loose sausage, so just pick out one you like. I chose to go with a hot sausage, but mild or sweet would work just the same.",
  "Once the sausage has been laid down sprinkle some more rub liberally to the sausage.",
  "Now this is the part where you can get creative. On this smoke we made one that is mild (for Caitlin) and one a little spicier (for us). For the spicy one, we threw on some jalapeños, hot sauce, and cheese. On the mild one, we simply took the leftover slices of bacon, fried them up and threw them on top of the sausage.",
  "(Note: It’s okay, and encouraged, to snack on these bacon pieces while you’re chopping/crumbling. But keep in mind that once those bacon morsels touch the raw sausage, you’ll need to resist all temptations to nibble. This can and will be difficult, but hospital trips are no fun, so stay strong.)",
  "Now comes the critical moment where we have to roll all of this pork goodness up. It helps to have another person with you to help you roll it up and then use toothpicks to hold down the loose ends of bacon to keep it together. Once you have gotten to this part, take a sigh of relief, grab a beer, and smile…as the hard part is over and you will be smooth sailing moving forward.",
  "Sprinkle some more of the rub on the outside of the bacon weave, and now this bad boy is ready for the smoker. Put the bacon explosion over indirect heat at 225 – 250 degrees in a constant cloud of smoke until the meat reaches an internal temperature of 165 degrees. I used apple and cherry wood for my smoke as I found the sweetness works well with the bacon. Normally this will take about 1 hour for each inch of thickness, but that could vary depending on how well you maintain your fire and also how many times you open the smoker to take a peek.",
  "Now when your explosion is almost done (temp of about 145-150) baste the roll with your favorite sauce and let it finish off for the last 30 mins, allowing the sauce to get sticky. Use your favorite sauce but make sure it is a thick one as the thinner Carolina vinegar based sauces won’t create that nice thick, sticky finish.",
  "Now remove the roll from the smoker and remove the toothpicks as the heat should have seared the bacon together.",
  "Slice the bacon explosion into quarter to half inch rounds to serve. I usually make these for a party and I have seen people make sandwiches out of it, or just eat it by itself. All are baconly good and this is sure to be the talk of your party as most people are in bacon nirvana once they take a bite."
  ],
  "notes":"",
  "ingredients":[
  "1 lb of bacon (thick sliced is preferred)",
  "1 lb of Italian sausage (Hot or sweet whatever you prefer)",
  "Your seasoning of choice (or The BBQ Brother’s All-purpose BBQ Rub)",
  "Your favorite BBQ sauce',
  "Any other toppings you want (cheese, jalapeños, hot sauce, more bacon, etc.)",
  "Toothpicks"
  ],
  "tags":[
  "bacon",
  "meat",
  "smoker",
  "wrapped"
  ]
}
