{
  "title":"Smoked Pork Butt",
  "description":"Smoked Pork Butt (also known as pork shoulder, Boston butt, and Boston Roast) was one of the very first things we cooked when we bought our first smoker several years ago. It was and still remains one of our very favorites to cook, despite the intense commitment to time (not to mention $$$) it takes to prep and cook the darn thing.",
  "date":"2019-10-03",
  "url":"https://www.vindulge.com/smoked-pork-butt-pork-shoulder/",
  "prepTime":"1 hour",
  "cookTime":"5 hours",
  "totalTime":"6 hours",
  "servings":8,
  "directions":[
    "The night before cooking, prepare pork. Remove excess fat cap, and any glands. Rinse with cold water and then place onto a cookie sheet, and inject the meat. Discard any liquid that pools in the pan and then pat dry the pork.",
    "Apply mustard and then dry rub thoroughly. If you don’t have time to do the night before try to apply at least an hour before cooking. You’ll see the rub begin to liquefy as the moisture connects with the meat.",
    "Preheat smoker to 250 degrees Fahrenheit. We use apple or cherry wood, then switch to oak or charcoal. Insert a thermometer if you have a remote probe, and leave in place.",
    "Place the pork fat cap side up (if you left the cap on) and smoke for about three hours. You’ll see a bark begin to develop. After three hours, spritz (or spray) every fifteen minutes. After about five hours total, check the temperature. When the pork hits on or around 165 degrees Fahrenheit, it’s likely coming out of the stall and ready to wrap. This will change from meat to meat, you will see the temperature hover and only go up in a few degrees per hour. It pushes through the stall when you start to see the temperature increase in a much faster pace (between 165 to 175).",
    "As you complete the stall, (remove the thermometer at this point if you have one) place the pork into a pan, add a small amount (two tablespoons) of your spritz into the pan and wrap in foil tightly. Put the thermometer back on place.",
    "Continue cooking wrapped until the internal temperature is between 200 and 203. The thermometer should slide right in as if it is room temperature butter. If you are using a probe, then insert a toothpick or a small knife for the same effect.",
    "Remove from smoker (leave wrapped), and then wrap in a towel (one that you are okay with getting dirty). Place into a cooler (with NO ice) and let it rest for an hour. It will act as a warmer and keep the pork warm for hours, so if you are planning an event, better to be done early and let it sit.",
    "After one hour, remove from cooler and begin pulling. Remove the bone (it will just slide right out clean), and then pull with your favorite tool or with your hands. It is likely there will be some cartilage or other fatty pieces, be sure to pull those out (it’s not a good texture).",
    "You may also opt to add a few tablespoons of BBQ sauce to mix in as well, or just top your pulled pork sandwiches with it. See BBQ sauce in notes, and also a link below the video.",
    "Serve and enjoy!"
  ],
  "notes":"Serving Tip: Pull meat as close to service as possible, once you pull, it starts to cool down fast. If you need to reheat, put back into smoker or oven covered with a little apple cider vinegar.",
  "ingredients":[
    "1 8-10 lb pork shoulder, or boston butt",
    "1/4 cup brown sugar",
    "1/4 cup salt",
    "1 tablespoon chili powder",
    "1 tablespoon smoked paprika",
    "1/2 tablespoon dry mustard",
    "1/2 tablespoon cumin",
    "1/2 teaspoon cayenne",
    "2 teaspoons garlic powder",
    "1 teaspoon onion powder",
    "1 cup of apple cider vinegar",
    "1 cup apple juice",
    "1 cup apple cider vinegar",
    "1 cup water"
  ],
  "tags":["barbecue pork", "pork"]
}
