{
    "title":"Smoked Pork Shoulder",
    "description":"This 7 hour smoked pulled pork shoulder is so good that no sauce is needed. Just throw it on some white bread, sweet Hawaiian buns, in a taco, or even an omelette.",
    "date":"2018-04-25",
    "url":"https://saltpepperskillet.com/recipes/smoked-pork-shoulder/",
    "imageUrl":"images/smoked-pork-shoulder.jpg",
    "prepTime":"1 minutes",
    "cookTime":"6 hours",
    "totalTime":"7 hours",
    "servings":8,
    "directions":[
      "Combine all the dry rub ingredients in a small bowl or a shaker.",
      "Trim excess fat from the pork shoulder. If it's Boston Butt, you don't have to trim any. Score the fat side with a sharp knife.",
      "Rub a liberal amount of the rub all over the pork. You should have some extra dry rub that can be saved for next time. Cover and refrigerate overnight, or for at least 12 hours.",
      "Remove the pork shoulder from the refrigerator at least 1 hour prior to cooking it.",
      "Follow your smoker's instructions and bring the temperature up to 250 degrees Fahrenheit and add wood chips. Place a water-filled aluminum drip pan under the grates to catch drippings.",
      "Place the pork shoulder on the grate above drip pan after the smoker begins to smoke and is at 250 degrees.",
      "Smoke for about 60 to 90 minutes per pound, or until the internal temperature reaches 195-205 degrees. Continuously monitor the temperature with a probe thermometer.",
      "Remove the pork shoulder from the smoker and wrap in butcher paper or aluminum and place in a cooler to rest for at least one hour.",
      "Shred the pork using or a large fork or BBQ meat forks, pulling across the strands to maintain the texture."
    ],
    "notes":"",
    "ingredients":[
      "4 to 5 lb Boneless Pork Shoulder or Boston Butt, trimmed",
      "1/8 cup Paprika",
      "2 tbsp Packed Dark Brown Sugar",
      "2 tbsp Kosher Salt",
      "1 tbsp Dark Chili Powder",
      "1 tbsp Cumin",
      "1/2 tbsp Dried Oregano",
      "1/2 tbsp Granulated Sugar",
      "1/2 tbsp Ground Black Pepper",
      "1/2 tbsp Celery Seeds"
    ],
    "tags":[
      "Pork",
      "Pork Shoulder",
      "Dinner",
      "Dry Rub"
    ]
  }
  