{
  "title":"Smoked Salmon with Maple Orange Glaze",
  "description":"This Smoked Salmon with Maple Orange Glaze is the most delectable, smoky, melt in your mouth salmon you will ever have. While this process requires a little bit of time and patience, it is totally worth it! Believe me when I say you've never had salmon quite like this before. It is one smoke that is well worth the wait.",
  "date":"2019-10-2",
  "url":"https://heygrillhey.com/hot-smoked-salmon-maple-orange-glaze/",
  "imageUrl":"images/smoked-salmon-with-maple-orange-glaze.jpg",
  "prepTime":"5 minutes",
  "cookTime":"180 minutes",
  "totalTime":"1385 minutes",
  "servings":8,
  "directions":[
    "In a glass baking dish, combine all of the ingredients for the curing liquid and stir until the salt is dissolved. Gently submerge your salmon portions in the curing liquid, cover, and refrigerate for 8-12 hours. If your salmon fillets are thin, 8 hours should be enough. Thicker fillets will take 12 hours.",
    "Remove the salmon from the curing liquid and transfer to a cooling rack positioned over a cookie sheet. Place the salmon in the refrigerator for 8 hours, or overnight to develop a pellicle.",
    "In a small bowl, combine the maple syrup and orange juice and set aside.",
    "Preheat your smoker to 165-170 degrees F. Place the salmon on the grates skin side down and smoke for 3-4 hours, or until the internal temperature of the salmon reaches 145 degrees. Brush your salmon with the maple/orange juice glaze every hour while smoking.",
    "Hot smoked salmon can be served warm or cold. Simply flake and eat."
  ],
  "notes":"Significant portion of the Total Time is leaving the fish to cure and varies from 8-12 hours",
  "ingredients":[
    "2-3 pound salmon fillet cut into individual portions",
    "Curing Liquid",
    "4 cups cool water",
    "1 cup maple syrup",
    "1/2 cup brown sugar",
    "1/3 cup kosher salt",
    "zest of 1 orange",
    "Maple Orange Glaze",
    "1/2 cup maple syrup",
    "1/4 cup orange juice"
  ],
  "tags":[
    "Salmon fillet",
    "Dinner",
    "Fish",
    "Smoked Salmon",
    "Smoked Fish"
  ]
}
